; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v4 - type_2 ?v5 - type_3)
 	      (pred_2 ?v8 - object ?v5 - type_3)
	      (pred_1 ?v4 - type_2 ?v6 - type_1)
	      (pred_3 ?v4 - type_2 ?v8 - object ?v6 - type_1))

   (:action op_1
       :parameters  (?v4 - type_2 ?v2 ?v7 - type_3)
       :precondition (and  (pred_4 ?v4 ?v2))
       :effect (and  (pred_4 ?v4 ?v7)
		     (not (pred_4 ?v4 ?v2))))

   (:action op_3
       :parameters (?v4 - type_2 ?v3 - object ?v1 - type_3 ?v6 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v1) (pred_4 ?v4 ?v1) (pred_1 ?v4 ?v6))
       :effect (and (pred_3 ?v4 ?v3 ?v6)
		    (not (pred_2 ?v3 ?v1)) 
		    (not (pred_1 ?v4 ?v6))))

   (:action op_2
       :parameters (?v4 - type_2 ?v3 - object ?v1 - type_3 ?v6 - type_1)
       :precondition  (and  (pred_3 ?v4 ?v3 ?v6) (pred_4 ?v4 ?v1))
       :effect (and (pred_2 ?v3 ?v1)
		    (pred_1 ?v4 ?v6)
		    (not (pred_3 ?v4 ?v3 ?v6)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_07 - type_2
obj_02 obj_04 - type_1
obj_05 obj_08 obj_01 obj_09 - type_3
obj_10 obj_03 obj_06 - object)
(:init
(pred_4 obj_07 obj_01)
(pred_1 obj_07 obj_02)
(pred_1 obj_07 obj_04)
(pred_2 obj_10 obj_05)
(pred_2 obj_03 obj_08)
(pred_2 obj_06 obj_09)
)
(:goal
(and
(pred_2 obj_10 obj_01)
(pred_2 obj_03 obj_09)
(pred_2 obj_06 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_07 ?b obj_04))))
)
)

; plan
1. (op_1 obj_07 obj_01 obj_05)
   deleted: (pred_4 obj_07 obj_01)
   added: (pred_4 obj_07 obj_05)
   goals met: 0 of 3
2. (op_3 obj_07 obj_10 obj_05 obj_02)
   deleted: (pred_2 obj_10 obj_05) (pred_1 obj_07 obj_02)
   added: (pred_3 obj_07 obj_10 obj_02)
   goals met: 0 of 3
3. (op_1 obj_07 obj_05 obj_01)
   deleted: (pred_4 obj_07 obj_05)
   added: (pred_4 obj_07 obj_01)
   goals met: 0 of 3
4. (op_2 obj_07 obj_10 obj_01 obj_02)
   deleted: (pred_3 obj_07 obj_10 obj_02)
   added: (pred_2 obj_10 obj_01) (pred_1 obj_07 obj_02)
   goals met: 1 of 3
5. (op_1 obj_07 obj_01 obj_09)
   deleted: (pred_4 obj_07 obj_01)
   added: (pred_4 obj_07 obj_09)
   goals met: 1 of 3
6. (op_3 obj_07 obj_06 obj_09 obj_02)
   deleted: (pred_2 obj_06 obj_09) (pred_1 obj_07 obj_02)
   added: (pred_3 obj_07 obj_06 obj_02)
   goals met: 1 of 3
7. (op_1 obj_07 obj_09 obj_05)
   deleted: (pred_4 obj_07 obj_09)
   added: (pred_4 obj_07 obj_05)
   goals met: 1 of 3
8. (op_2 obj_07 obj_06 obj_05 obj_02)
   deleted: (pred_3 obj_07 obj_06 obj_02)
   added: (pred_2 obj_06 obj_05) (pred_1 obj_07 obj_02)
   goals met: 2 of 3
9. (op_1 obj_07 obj_05 obj_08)
   deleted: (pred_4 obj_07 obj_05)
   added: (pred_4 obj_07 obj_08)
   goals met: 2 of 3
10. (op_3 obj_07 obj_03 obj_08 obj_02)
   deleted: (pred_2 obj_03 obj_08) (pred_1 obj_07 obj_02)
   added: (pred_3 obj_07 obj_03 obj_02)
   goals met: 2 of 3
11. (op_1 obj_07 obj_08 obj_09)
   deleted: (pred_4 obj_07 obj_08)
   added: (pred_4 obj_07 obj_09)
   goals met: 2 of 3
12. (op_2 obj_07 obj_03 obj_09 obj_02)
   deleted: (pred_3 obj_07 obj_03 obj_02)
   added: (pred_2 obj_03 obj_09) (pred_1 obj_07 obj_02)
   goals met: 3 of 3
